Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་དེ་དག་ལ་བསྙེན་བཀུར་བྱེད་དོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཡང་དགེ་བའི་རྩ་བ་གང་གིས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྱུར་བ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་འགྱུར་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་བྱེད་དེ།
en: They develop the roots of virtuous action through which, in the presence of those lord buddhas, they refine the buddhafields and bring beings to maturity.

source: འཇིག་རྟེན་གྱི་ཁམས་ནས་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་ཞིང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ།
en: Proceeding from mundane realm to mundane realm, they act on behalf of beings.

source: །དེ་ལ་སེམས་ཅན་ལ་ལ་ནི་སྦྱིན་པས་ཡོངས་སུ་བསྡུད་དོ།
en: Some beings they attract by means of generosity.

source: །ལ་ལ་ནི་ཚུལ་ཁྲིམས་ཀྱིས་ཡོངས་སུ་བསྡུད་དོ།
en: Some they attract by means of ethical discipline.

source: །ལ་ལ་ནི་ཏིང་ངེ་འཛིན་གྱིས་ཡོངས་སུ་བསྡུད་དོ།
en: Some they attract by means of meditative stability.

source: །ལ་ལ་ནི་ཤེས་རབ་ཀྱིས་ཡོངས་སུ་བསྡུད་དོ།
en: Some they attract by means of wisdom.

source: །ལ་ལ་ནི་རྣམ་པར་གྲོལ་བས་ཡོངས་སུ་བསྡུད་དོ།
en: Some they attract by means of liberation.

source: །ལ་ལ་ནི་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བས་ཡོངས་སུ་བསྡུད་དོ།
en: Some they attract by means of the wisdom of liberation. “

source: །ལ་ལ་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་རབ་ཏུ་གཞོག་གོ །ལ་ལ་ནི་ལན་གཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ལ་རབ་ཏུ་གཞོག་གོ །
en: They establish some in the fruit of entering the stream to nirvāṇa, and they establish some in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and in arhatship.

source: ལ་ལ་ནི་རང་བྱང་ཆུབ་ལ་རབ་ཏུ་གཞོག་གོ །ལ་ལ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་གཞོག་གོ །
en: They establish some in individual enlightenment, and they establish some in unsurpassed, complete enlightenment. “

source: དེ་དེ་ལྟར་དགེ་བའི་ཆོས་གང་དང་གང་གིས་སེམས་ཅན་རྣམས་མཐོང་བར་འགྱུར་བ་དེ་དང་དེ་ལ་སྦྱོར་ཏེ།
en: They engage beings in whichever virtuous attributes will manifestly elevate them.

source: དེ་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་གནས་ཤིང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་མངོན་པར་སྒྲུབ་བོ། །སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་རབ་ཏུ་འཐོབ་བོ། །རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་མངོན་པར་ཤེས་པ་རྣམས་ཀྱང་ཐོབ་པ་ཡིན་ཏེ།
en: Abiding in this perfection of meditative stability, they actualize all the dhāraṇī gateways, they attain the four kinds of exact knowledge, and they also acquire the extrasensory powers that arise from the maturation [of past actions].

source: དེ་ནམ་ཡང་ལས་དང་ཉོན་མོངས་པའི་དབང་གིས་མའི་མངལ་དུ་སྐྱེ་བར་མི་འགྱུར་རོ།
en: They will never again be reborn in a mother’s womb owing to past actions and afflicted mental states.

source: །ནམ་ཡང་འདོད་པ་ལ་སྟེན་པར་མི་འགྱུར་རོ། །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་དུ་སྐྱེ་བ་ཡོངས་སུ་མི་འཛིན་པ་ཡང་གང་ཡང་མེད་དོ།
en: They will never again be reliant on desires, but there is no rebirth at all that they will not assume in order to bring beings to maturity.

source: །སྐྱེ་བའི་ཉེས་པས་ཀྱང་ཡོངས་སུ་གོས་པར་མི་འགྱུར་རོ།
en: They will be untainted even by the defects of birth.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེས་སྒྱུ་མ་ལྟ་བུའི་ཆོས་ཐམས་ཅད་རབ་ཏུ་མཐོང་། །རབ་ཏུ་རིག་རབ་ཏུ་རྟོགས་པས་ན། དེ་སྒྱུ་མ་ལྟ་བུའི་འདུ་བྱེད་ཐམས་ཅད་རིག་པར་བྱས་ཤིང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བྱེད་དོ།
en: If you ask why, it is because when they discern, are aware, and understand that all phenomena resemble a magical display, they know that all conditioned phenomena resemble a magical display, and they act for the benefit of all beings.

source: །དེས་སྒྱུ་མ་ལྟ་བུའི་འདུ་བྱེད་ཐམས་ཅད་རབ་ཏུ་རིག་པས། སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེ་སྟེ།
en: By knowing that all conditioned phenomena are like a magical display, they generate great compassion for beings, with the thought, ‘Alas!

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུ་ལ་འཁོར་བ་ན་སྡུག་བསྔལ་མང་པོ་ཉམས་སུ་མྱོང་བར་གྱུར་པ་ཡིན་ན།
en: These beings have experienced much suffering in cyclic existence although all phenomena are like a magical display.

source: བདག་གིས་འདི་དག་ནམ་ཞིག་ན་སྡུག་བསྔལ་ཐམས་ཅད་ཉེ་བར་ཞི་བའི་མྱ་ངན་ལས་འདས་པ་ལ་དགོད་པར་འགྱུར་ཞེས་སྙིང་རྗེ་ཆེན་པོ་སྐྱེ་སྟེ།
en: At some time or another I will establish all those imbued with suffering in quiescent nirvāṇa!’

source: དེ་ལ་ཡང་སེམས་ཅན་ནམ་སེམས་ཅན་དུ་གདགས་པ་དམིགས་སུ་མེད་དེ་དེས་ཆོས་ཐམས་ཅད་མ་དམིགས་ནས་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཉེ་བར་བཟུང་སྟེ། དམིགས་སུ་མེད་པ་དེ་ཉིད་ལ་སེམས་ཅན་རྣམས་འགོད་དེ། དོན་དམ་པར་ནི་མ་ཡིན་ནོ།
en: Since beings, or [even] the concept ‘being,’ are not apprehended, they do not apprehend anything at all, and then, on the basis of worldly convention rather than ultimate reality, they establish beings in that nonapprehensible state. “

source: །དེ་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་གནས་ཤིང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པའི་ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་སྤྱོད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ནམ་དུ་ཡང་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་མི་འགྱུར་རོ།
en: Abiding in this perfection of meditative stability, they practice all the meditative concentrations, liberating meditative stabilities, and absorptions, and they will never be separated from the perfection of meditative stability until they have attained consummate buddhahood in unsurpassed, complete enlightenment. {

source: །དེ་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་གནས་ཤིང་།
en: Ki.

source: ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མངོན་པར་སྒྲུབ་སྟེ། དེ་ལ་གནས་ནས།
en: VII: 27} Abiding in this perfection of meditative stability, through knowledge of the path they actualize all-aspect omniscience.

source: བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་རབ་ཏུ་སྤོང་ངོ་། །བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་རབ་ཏུ་སྤངས་ནས་བདག་གི་དོན་ཀྱང་བྱེད་གཞན་གྱི་དོན་ཀྱང་བྱེད་དེ།
en: Abiding in it, they abandon all reincarnation due to propensities, and then act both for the benefit of themselves and for the benefit of others.

source: དེས་བདག་དང་གཞན་གྱི་དོན་བྱས་ནས། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་རིམ་གྲོའི་གནས་སུ་གྱུར་པ་ཡིན་ཏེ།
en: Acting for the benefit of themselves and others, they become worthy of the service of the world with its gods, human beings, and asuras.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས། ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of meditative stability, with a mind that is devoid of concepts in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned. “

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས་ཡང་དག་པ་འམ་ཡོངས་སུ་གྲུབ་པའི་ཆོས་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་མེད་དོ།
en: Subhūti, if you ask how, when bodhisattva great beings practice the perfection of wisdom, they complete the cultivation of the perfection of wisdom with a mind that is devoid of concepts, in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they do not observe anything at all that is true or absolutely existing, with a mind devoid of concepts in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned, starting from the time when they first begin to set their mind on enlightenment.

source: །གཟུགས་ཀྱི་ཡང་དག་པ་དང་། ཡོངས་སུ་གྲུབ་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་ཡང་དག་པ་དང་། ཡོངས་སུ་གྲུབ་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། དེས་གཟུགས་ཀྱི་ཡང་དག་པ་དང་། ཡོངས་སུ་གྲུབ་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཚོར་བ་དང་འདུ་ཤེས་དང་།
en: They do not observe the truth or absolute existence of physical forms, and they do not observe the truth or absolute existence of feelings, perceptions, formative predispositions, or consciousness.

source: འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ཡང་དག་པ་དང་། ཡོངས་སུ་གྲུབ་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། གཟུགས་ཀྱི་སྐྱེ་བ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་སྐྱེ་བ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Since they do not observe the truth or absolute existence of physical forms and do not observe the truth or absolute existence of feelings, perceptions, formative predispositions, or consciousness, they do not even observe the arising of physical forms, and they do not even observe the arising of feelings, perceptions, formative predispositions, or consciousness.

source: །དེས་གཟུགས་ཀྱི་སྐྱེ་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་སྐྱེ་བ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། གཟུགས་ཀྱི་སྐྱེ་བའི་སྒོ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་སྐྱེ་བའི་སྒོ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Since they do not even observe the arising of physical forms and they do not observe the arising of feelings, perceptions, formative predispositions, or consciousness, they do not observe the sensory portal for the arising of physical forms, and they do not observe the sensory portal for the arising of feelings, perceptions, formative predispositions, or consciousness.

source: །དེས་གཟུགས་ཀྱི་སྐྱེ་བའི་སྒོ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་སྐྱེ་བའི་སྒོ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། གཟུགས་ཀྱི་ཚོགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་།
en: Since they do not observe the sensory portal for the arising of physical forms, and they do not observe the sensory portal for the arising of feelings, perceptions, formative predispositions, or consciousness, they do not observe the grouping of physical forms, and they do not observe the grouping of feelings, perceptions, formative predispositions, and consciousness.

source: རྣམ་པར་ཤེས་པའི་ཚོགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not observe them as hollowness or voidness.

source: གསོབ་ཉིད་དང་། གསོག་ཉིད་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་ཡང་དག་པ་དང་། ཡོངས་སུ་གྲུབ་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། དེས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡང་དག་པ་དང་།
en: They do not observe the truth or absolute existence of [any attributes or goals], up to and including all-aspect omniscience.

source: ཡོངས་སུ་གྲུབ་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྐྱེ་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྐྱེ་བ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྐྱེ་བའི་སྒོ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Since they do not observe the arising of all-aspect omniscience [and so forth], they do not observe the sensory portal for the arising of all-aspect omniscience [and so forth].

source: །དེས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྐྱེ་བའི་སྒོ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། གསོབ་ཉིད་དང་།
en: Since they do not observe the sensory portal for the arising of all-aspect omniscience [and so forth], they do not observe the grouping of all-aspect omniscience [and so forth].

source: གསོག་ཉིད་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: They do not observe them as hollowness or voidness. “

source: །དེ་དེ་ལྟར་རྟོག་པའི་ཚེ། གཟུགས་ཀྱི་རང་བཞིན་མི་དམིགས་སོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་རང་བཞིན་མི་དམིགས་སོ།
en: When they reflect in that manner, they do not apprehend the inherent existence of physical forms, and they do not apprehend the inherent existence of feelings, perceptions, formative predispositions, or consciousness.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་རང་བཞིན་མི་དམིགས་སོ།
en: They do not apprehend the inherent existence of [the attributes and goals], up to and including all-aspect omniscience.

source: །དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་རང་བཞིན་དུ་རྟོགས་པར་བྱེད་དེ། །དེ་དེ་ལྟར་རྟོགས་པར་བྱེད་ཅིང་། ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་པ་དང་། ཕྱི་སྟོང་པ་ཉིད་ལ་སྤྱོད་པ་དང་།
en: When they practice the perfection of wisdom in that manner, they realize that all phenomena have the essential nature of nonentity.

source: ཕྱི་ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་སམ། ཚོར་བ་འམ་འདུ་ཤེས་སམ། འདུ་བྱེད་དམ། རྣམ་པར་ཤེས་པ་འམ། སྐྱེ་མཆེད་དམ་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་འམ། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་སམ། སྟོང་པ་ཉིད་རྣམས་སམ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སམ། འཕགས་པའི་བདེན་པ་རྣམས་སམ། བསམ་གཏན་རྣམས་སམ། ཚད་མེད་པ་རྣམས་སམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། རྣམ་པར་ཐར་པ་རྣམས་སམ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་རྣམས་སམ། མངོན་པར་ཤེས་པ་རྣམས་སམ། ཏིང་ངེ་འཛིན་རྣམས་སམ། གཟུངས་ཀྱི་སྒོ་རྣམས་སམ།
en: Realizing this, when they engage with the emptiness of internal phenomena, engage with the emptiness of external phenomena, engage with the emptiness of external and internal phenomena, and engage with [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, they are not fixated upon anything at all, whether physical forms, feelings, perceptions, formative predispositions, consciousness, the sense fields, the sensory elements, the links of dependent origination, the perfections, the aspects of emptiness, the factors conducive to enlightenment, the noble truths, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, {Ki.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་སམ། མི་འཇིགས་པ་རྣམས་སམ། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་སམ། བྱམས་པ་ཆེན་པོ་འམ། སྙིང་རྗེ་ཆེན་པོ་འམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སམ།
en: VII: 28} the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, the distinct qualities of the buddhas, or [the goals], up to and including unsurpassed, complete enlightenment. “

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་རམ། ཆོས་གང་ལ་ཡང་མངོན་པར་ཆགས་པ་མེད་དོ། །དེ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: When they practice the perfection of wisdom as the essential nature of nonentity, they complete the path of enlightenment.

source: འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: In this way they complete the six perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོངས་སུ་འཛིན་ཏོ། །དེ་བྱང་ཆུབ་ཀྱི་ལམ་རྣམ་པར་སྨིན་པའི་ཆོས་ཅན་ལ་གནས་པས།
en: They complete the thirty-two major marks and the eighty excellent minor marks of a great person. “

source: ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོངས་སུ་རྫོགས་པ་དང་། རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་མངོན་པར་ཤེས་པ་ལྔའི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ནས། སེམས་ཅན་དེ་གང་ལ་སྦྱིན་པས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ཡང་སྦྱིན་པས་ཕན་འདོགས་སོ།
en: Those who maintain these attributes through which the path of enlightenment is ripened, after completing the six perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment, and after completing [the fruitional attributes], up to and including the five extrasensory powers that originate from the maturation [of past actions], then help with generosity those beings who should be helped with generosity.

source: །གང་ཚུལ་ཁྲིམས་ཀྱིས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ཡང་། ཚུལ་ཁྲིམས་ཀྱིས་ཕན་འདོགས་སོ།
en: They help with ethical discipline those who should be helped with ethical discipline.

source: །གང་ལ་བཟོད་པས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ཡང་བཟོད་པས་ཕན་འདོགས་སོ།
en: They help with tolerance those who should be helped with tolerance.

source: །གང་ལ་བརྩོན་འགྲུས་ཀྱིས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ཡང་བརྩོན་འགྲུས་ཀྱིས་ཕན་འདོགས་སོ།
en: They help with perseverance those who should be helped with perseverance.

source: །གང་ལ་ཏིང་ངེ་འཛིན་གྱིས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ཡང་ཏིང་ངེ་འཛིན་གྱིས་ཕན་འདོགས་སོ།
en: They help with meditative stability those who should be helped with meditative stability.

source: །གང་ལ་ཤེས་རབ་ཀྱིས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ཡང་ཤེས་རབ་ཀྱིས་ཕན་འདོགས་སོ།
en: They help with wisdom those who should be helped with wisdom.

source: །གང་ལ་རྣམ་པར་གྲོལ་བས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ཡང་རྣམ་པར་གྲོལ་བས་ཕན་འདོགས་སོ།
en: They help with liberation those who should be helped with liberation.

source: །གང་ལ་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བས་ཕན་གདགས་པར་བྱ་བ་དེ་དག་ལ་ཡང་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བས་ཕན་འདོགས་སོ།
en: They help with seeing the wisdom of liberation those who should be helped with seeing the wisdom of liberation.

source: །གང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་དགོད་པར་བྱ་བ་དེ་དག་ཀྱང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་རབ་ཏུ་དགོད་དོ།
en: They establish in the fruit of entering the stream to nirvāṇa those who should be established in the fruit of entering the stream to nirvāṇa.

source: །གང་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་དགོད་པར་བྱ་བ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་དགོད་དོ།
en: They establish in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, and unsurpassed, complete enlightenment those who should be established in unsurpassed, complete enlightenment [and so forth]. “

source: །དེ་རྫུ་འཕྲུལ་གྱི་རྣམ་པ་དུ་མས་རྣམ་པར་འཕྲུལ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་འགྲོ་སྟེ།
en: Emanating through many modes of miraculous ability, they travel to world systems as numerous as the grains of sand of the river Gaṅgā.

source: །དེ་འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་རིན་པོ་ཆེ་གང་ལས་འདོད་པའི་རིན་པོ་ཆེ་དེ་དག་ལས་གྲུབ་པར་མངོན་པར་བསྒྲུབས་ཏེ།
en: They materialize at will those world systems numerous as the grains of sand of the river Gaṅgā from whatever precious gems and metals they wish.

source: དེ་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅིང་། འཇིག་རྟེན་གྱི་ཁམས་ནས་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་སྟེ། དེས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་མཐོང་ནས་ཅི་འདོད་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་ཏེ།
en: Fulfilling the aspirations of beings, they proceed from world system to world system, and having seen these world systems, they acquire the buddhafields that they wish for.

source: འདི་ལྟར་དཔེར་ན་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་རིས་ཀྱི་ལོངས་སྤྱོད་དང་། སྐྱིད་པ་དེ་ལྟ་བུ་དག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གཞན་བཙལ་བ་དང་། བྲལ་བ་དག་དང་། ལོངས་སྤྱོད་དང་སྐྱིད་པ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་དེར་འབྱུང་སྟེ། དེ་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: However many resources and joys they need—just like the resources and joys in the god realm of Para­nirmita­vaśa­vartin, and those of other buddhafields, which do not need to be sought—will arise in their buddhafields.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་མངོན་པར་ཤེས་པ་རྣམས་དང་། རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་བྱང་ཆུབ་ཀྱི་ལམ་དེས་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལ་སྤྱོད་ཅིང་། ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་ཐོབ་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྗེས་སུ་འཐོབ་སྟེ། གལ་ཏེ་ཇི་ཙམ་དུ་གཟུགས་ཡོངས་སུ་བཟུང་བ་མེད་པ་དང་། ཚོར་བ་དང་།
en: Engaging in knowledge of the path through the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, which derive from the maturation [of past actions], as well as through the extrasensory powers that derive from the maturation [of past actions] and through the path of enlightenment that derives from the maturation [of past actions], they attain the fulfilment of all attributes, and then subsequently they will attain all-aspect omniscience.

source: འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་བཟུང་བ་མེད་པ་དང་། སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡོངས་སུ་བཟུང་བ་མེད་པ་དང་། དགེ་བ་དང་མི་དགེ་བ་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་བཟུང་བ་མེད་པ་དེ་བཞིན་དུ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ན།
en: If they attain consummate buddhahood in unsurpassed, complete enlightenment, commensurate with physical forms not being acquired; commensurate with feelings, perceptions, formative predispositions, and consciousness not being acquired; commensurate with the sense fields, the sensory elements, and the links of dependent origination not being acquired; and also commensurate with virtuous, nonvirtuous, mundane, supramundane, contaminated, uncontaminated, conditioned, and unconditioned attributes not being acquired, {Ki.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་ལོངས་སྤྱོད་དང་། སྐྱིད་པ་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བ་མེད་པར་འགྱུར་རོ།
en: VII: 29} then all the resources and joys in that buddhafield will be without acquisition.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་དམིགས་སུ་མེད་པའི་ཚུལ་གྱིས་ཡོངས་སུ་བཟུང་བ་མེད་པ་སྟེ།
en: If you ask why, it is because all phenomena are without acquisition owing to their being nonapprehensible.

source: ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བ་མེད་པའི་ཕྱིར་ཡང་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: Indeed, they teach the Dharma to beings so that they might not acquire anything. “

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཏེ། རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, they complete the perfections in that all phenomena are signless, uneffected, unapprehended, unoriginated.

source: བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: and unconditioned.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: They complete [all causal and fruitional attributes], up to and including the distinct qualities of the buddhas.”
